app/views/quotes/_quote.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 30]]
SELECT "categories"."catname" FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 3]]
---
  <strong>Category:</strong>
  <% if quote.categories.present? %>
    <%= quote.categories.pluck(:catname).join(', ') %>