app/controllers/home_controller.rb

  def index
    @quotes = Quote.includes(:categories).take(5)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 3]]
SELECT "quotes".* FROM "quotes" LIMIT ?  [["LIMIT", 5]]

  def uquotes
    @qoutes = Quote.includes(:categories).where(user_id: session[:user_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?)  [["id", 3], ["id", 4]]
SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = ?  [["user_id", 2]]