app/controllers/quotes_controller.rb

  def index
    if current_user
      @quotes = current_user.quotes
    else
      @quotes = Quote.all
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = ?  [["user_id", 2]]

  def edit
    @quote = Quote.find(params[:id])
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]

  def create
    @quote = Quote.new(quote_params)
    source_params = params.require(:quote).permit(:fname, :lname, :byear, :dyear, :bio)
    source = Source.find_or_create_by(fname: source_params[:fname], lname: source_params[:lname])
    source.update(source_params) # Update additional source attributes
    @quote.source = source

    category_name = params[:quote][:category_name]
    category = Category.find_or_create_by(catname: category_name)
    @quote.categories << category

    respond_to do |format|
      if @quote.save
---
INSERT INTO "sources" ("fname", "lname", "byear", "dyear", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["fname", "oshan"], ["lname", ""], ["byear", nil], ["dyear", nil], ["bio", nil], ["created_at", "2023-10-17 10:30:44.953951"], ["updated_at", "2023-10-17 10:30:44.953951"]]
SELECT "sources".* FROM "sources" WHERE "sources"."fname" = ? AND "sources"."lname" = ? LIMIT ?  [["fname", "oshan"], ["lname", ""], ["LIMIT", 1]]
UPDATE "sources" SET "byear" = ?, "dyear" = ?, "bio" = ?, "updated_at" = ? WHERE "sources"."id" = ?  [["byear", ""], ["dyear", ""], ["bio", ""], ["updated_at", "2023-10-17 10:30:44.993616"], ["id", 24]]
INSERT INTO "categories" ("catname", "created_at", "updated_at") VALUES (?, ?, ?)  [["catname", "common"], ["created_at", "2023-10-17 19:17:19.294305"], ["updated_at", "2023-10-17 19:17:19.294305"]]
SELECT "categories".* FROM "categories" WHERE "categories"."catname" = ? LIMIT ?  [["catname", "comic"], ["LIMIT", 1]]
INSERT INTO "quote_categories" ("quote_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["quote_id", 20], ["category_id", 4], ["created_at", "2023-10-16 16:02:12.378066"], ["updated_at", "2023-10-16 16:02:12.378066"]]
INSERT INTO "quotes" ("qtext", "qyear", "qcom", "ispublic", "user_id", "source_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["qtext", "hello asia"], ["qyear", ""], ["qcom", ""], ["ispublic", 0], ["user_id", 2], ["source_id", 20], ["created_at", "2023-10-16 16:02:12.373650"], ["updated_at", "2023-10-16 16:02:12.373650"]]
INSERT INTO "quote_categories" ("quote_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["quote_id", 27], ["category_id", 6], ["created_at", "2023-10-17 10:30:45.039079"], ["updated_at", "2023-10-17 10:30:45.039079"]]
INSERT INTO "quotes" ("qtext", "qyear", "qcom", "ispublic", "user_id", "source_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["qtext", "test 4"], ["qyear", ""], ["qcom", ""], ["ispublic", 0], ["user_id", 5], ["source_id", 24], ["created_at", "2023-10-17 10:30:45.034907"], ["updated_at", "2023-10-17 10:30:45.034907"]]

  def update
    @quote = Quote.find(params[:id])
    logger.debug "Updating quote with ID: #{params[:id]}"
    logger.debug "Params: #{quote_params}"
    respond_to do |format|
      if @quote.update(quote_params)
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
UPDATE "quotes" SET "qtext" = ?, "updated_at" = ? WHERE "quotes"."id" = ?  [["qtext", "test 45"], ["updated_at", "2023-10-17 10:48:25.688638"], ["id", 27]]

  def destroy
    @quote.destroy
---
DELETE FROM "quotes" WHERE "quotes"."id" = ?  [["id", 24]]