app/controllers/search_controller.rb

  def index
    category_query = params[:category_query]

    if category_query.present?
      @quotematch = Quote.joins(:quote_categories, :categories)
                        .where("LOWER(categories.catname) LIKE ?", "%#{category_query.downcase}%")
                        .distinct
---
SELECT "quotes".* FROM "quotes" INNER JOIN "quote_categories" ON "quote_categories"."quote_id" = "quotes"."id" INNER JOIN "categories" ON "categories"."id" = "quote_categories"."category_id" WHERE (LOWER(categories.catname) = LOWER('mexico'))
SELECT DISTINCT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "quote_categories"."category_id" = "categories"."id" INNER JOIN "quote_categories" "quote_categories_categories_join" ON "quote_categories_categories_join"."category_id" = "categories"."id" INNER JOIN "quotes" ON "quotes"."id" = "quote_categories_categories_join"."quote_id" WHERE (categories.catname LIKE '%Ethics%')