app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
   def index
    if logged_in? && is_administrator?
      @users = User.all

INSERT INTO "users" ("fname", "lname", "email", "password_digest", "is_admin", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "shimal7@gmail.com"], ["updated_at", "2023-10-16 11:59:59.722539"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)